In [1]:
import pandas as pd
pd.__version__

'1.1.3'

In [2]:
import numpy as np
import pandas as pd

In [3]:
labels=["a","b","c"]
my_list=[10,20,30]
arr= np.array([10,20,30])
d= {"a":10,"b":20,"c":30}

In [4]:
labels= ["level1","level2","level3"]
my_list=[50,350,800]
pd.Series(data=my_list, index=labels)

level1     50
level2    350
level3    800
dtype: int64

In [5]:
pd.Series(my_list,labels)

level1     50
level2    350
level3    800
dtype: int64

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [7]:
my_dictionary={"level1":50,"level2":350,"level3":800}

In [8]:
pd.Series(my_dictionary)

level1     50
level2    350
level3    800
dtype: int64

In [9]:
pd.Series(data=labels)

0    level1
1    level2
2    level3
dtype: object

In [10]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [11]:
ser1=pd.Series([1,2,3,4],index=["USA","GERMANY","USSR","JAPAN"])

In [12]:
math_scores=pd.Series([3.8,2.6,4.7,4.2],index=["studenta","studentb","studentc","studentd"])
math_scores["studentb"]

2.6

In [14]:
french_scores=pd.Series([4.3,3,3.2,4.5],index=["studenta","studentb","studentc","studentd"])
french_scores

studenta    4.3
studentb    3.0
studentc    3.2
studentd    4.5
dtype: float64

In [15]:
french_scores+math_scores

studenta    8.1
studentb    5.6
studentc    7.9
studentd    8.7
dtype: float64

In [16]:
ser1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [17]:
ser1["USA"]

1

In [19]:
from numpy.random  import randn
np.random.seed(101)

In [20]:
np.random.randint(5)

3

In [21]:
"a b c d e".split()

['a', 'b', 'c', 'd', 'e']

In [22]:
df=pd.DataFrame(randn(5,4),index=["a","b","c","d","e"],columns="w x y z".split())
df

          w         x         y         z
a -0.431203  0.064624  0.521801 -0.925104
b -0.510021  0.882200  0.312745  0.555649
c  0.234393 -1.340208 -1.079692 -0.501881
d -0.168145 -0.108067  1.511444  0.683461
e  0.939919 -1.134972 -0.635792  0.025160

In [23]:
df["y"]

a    0.521801
b    0.312745
c   -1.079692
d    1.511444
e   -0.635792
Name: y, dtype: float64

In [24]:
df[["w","z"]]

          w         z
a -0.431203 -0.925104
b -0.510021  0.555649
c  0.234393 -0.501881
d -0.168145  0.683461
e  0.939919  0.025160

In [25]:
type(df["w"])

pandas.core.series.Series

In [26]:
df["new"]=df["w"]+df["y"]
df

          w         x         y         z       new
a -0.431203  0.064624  0.521801 -0.925104  0.090598
b -0.510021  0.882200  0.312745  0.555649 -0.197276
c  0.234393 -1.340208 -1.079692 -0.501881 -0.845299
d -0.168145 -0.108067  1.511444  0.683461  1.343299
e  0.939919 -1.134972 -0.635792  0.025160  0.304127

In [27]:
df.drop("new",axis=1)

          w         x         y         z
a -0.431203  0.064624  0.521801 -0.925104
b -0.510021  0.882200  0.312745  0.555649
c  0.234393 -1.340208 -1.079692 -0.501881
d -0.168145 -0.108067  1.511444  0.683461
e  0.939919 -1.134972 -0.635792  0.025160

In [28]:
df.drop("new",axis=1,inplace=True)
df

          w         x         y         z
a -0.431203  0.064624  0.521801 -0.925104
b -0.510021  0.882200  0.312745  0.555649
c  0.234393 -1.340208 -1.079692 -0.501881
d -0.168145 -0.108067  1.511444  0.683461
e  0.939919 -1.134972 -0.635792  0.025160

In [29]:
df.loc["a"]

w   -0.431203
x    0.064624
y    0.521801
z   -0.925104
Name: a, dtype: float64

In [30]:
df.iloc[2:4,2:]

          y         z
c -1.079692 -0.501881
d  1.511444  0.683461

In [31]:
df.loc[["a","b"],["w","y"]]

          w         y
a -0.431203  0.521801
b -0.510021  0.312745

In [32]:
logic_df =df>0
logic_df

       w      x      y      z
a  False   True   True  False
b  False   True   True   True
c   True  False  False  False
d  False  False   True   True
e   True  False  False   True

In [34]:
logic_df.iloc[1:,2:4]

       y      z
b   True   True
c  False  False
d   True   True
e  False   True

In [35]:
df[df["w"]>0]

          w         x         y         z
c  0.234393 -1.340208 -1.079692 -0.501881
e  0.939919 -1.134972 -0.635792  0.025160

In [36]:
df[df["w"]>0][["y","x","w"]]

          y         x         w
c -1.079692 -1.340208  0.234393
e -0.635792 -1.134972  0.939919

In [37]:
df[(df["w"]>0) & (df["y"]>1)]

Empty DataFrame
Columns: [w, x, y, z]
Index: []

In [38]:
df_reseted=df.reset_index()
df_reseted

  index         w         x         y         z
0     a -0.431203  0.064624  0.521801 -0.925104
1     b -0.510021  0.882200  0.312745  0.555649
2     c  0.234393 -1.340208 -1.079692 -0.501881
3     d -0.168145 -0.108067  1.511444  0.683461
4     e  0.939919 -1.134972 -0.635792  0.025160

In [40]:
    newind=" CA NY WY OR CO ".split()
    newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [44]:
df["States"]=newind
df

          w         x         y         z States states
a -0.431203  0.064624  0.521801 -0.925104     CA     CA
b -0.510021  0.882200  0.312745  0.555649     NY     NY
c  0.234393 -1.340208 -1.079692 -0.501881     WY     WY
d -0.168145 -0.108067  1.511444  0.683461     OR     OR
e  0.939919 -1.134972 -0.635792  0.025160     CO     CO

In [45]:
df.set_index("States",inplace=True)
df

               w         x         y         z states
States
CA     -0.431203  0.064624  0.521801 -0.925104     CA
NY     -0.510021  0.882200  0.312745  0.555649     NY
WY      0.234393 -1.340208 -1.079692 -0.501881     WY
OR     -0.168145 -0.108067  1.511444  0.683461     OR
CO      0.939919 -1.134972 -0.635792  0.025160     CO

In [46]:
outside=["G1","G1","G1","G2","G2"]
inside =[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2)]

In [47]:
hier_index=pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2)],
           )

In [48]:
df=pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=["a","b"])
df

ValueError: Shape of passed values is (6, 2), indices imply (5, 2)

In [51]:
df.loc["G1"].iloc[1]

KeyError: 'G1'

In [53]:
df=pd.DataFrame({"a":[1,2,np.nan],"b":[5,np.nan,np.nan],"c":[1,2,3]})
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [54]:
df.dropna(axis=1)

   c
0  1
1  2
2  3

In [55]:
df.dropna(thresh=2)

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2

In [57]:
df.dropna(axis=1,thresh=2)

     a  c
0  1.0  1
1  2.0  2
2  NaN  3

In [58]:
df["a"].fillna(value=df["a"].mean())

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [66]:
data={"Company":["GOOG","GOOG","MSFT","MSFT","FB","FB","VDF"],"Person":["Sam","Charlie","Amy","Vanessa","Carl","Sarah",np.nan],"Sales":[200,120,340,124,243,350,np.nan]}
data
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam  200.0
1    GOOG  Charlie  120.0
2    MSFT      Amy  340.0
3    MSFT  Vanessa  124.0
4      FB     Carl  243.0
5      FB    Sarah  350.0
6     VDF      NaN    NaN

In [67]:
df.groupby("Company").mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0
VDF        NaN

In [69]:
by_comp=df.groupby("Company")

In [70]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065
VDF             NaN

In [72]:
by_comp.min()

          Person  Sales
Company
FB          Carl  243.0
GOOG     Charlie  120.0
MSFT         Amy  124.0
VDF          NaN    NaN

In [73]:
by_comp.max()

          Person  Sales
Company
FB         Sarah  350.0
GOOG         Sam  200.0
MSFT     Vanessa  340.0
VDF          NaN    NaN

In [74]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2
VDF           0      0

In [75]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
VDF       0.0    NaN         NaN    NaN     NaN    NaN     NaN    NaN

In [76]:
by_comp.describe().transpose()["FB"].iloc[2]

75.66042558696059

In [77]:
df1=pd.DataFrame({"A":["AO","A1","A2","A3"],"B":["B0","B1","B2","B3"],"C":["C0","C1","C2","C3"],"D":["D0","D1","D2","D3"]},index=[0,1,2,3])
df1

    A   B   C   D
0  AO  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [79]:
df2=pd.DataFrame({"A":["A4","A5","A6","A7"],"B":["B4","B5","B6","B7"],"C":["C4","C5","C6","C7"],"D":["D4","D5","D6","D7"]},index=[4,5,6,7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [80]:
df3=pd.DataFrame({"A":["A8","A9","A10","A11"],"B":["B8","B9","B10","B11"],"C":["C8","C9","C10","C11"],"D":["D8","D9","D10","D11"]},index=[8,9,10,11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [81]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    AO   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [86]:
left=pd.DataFrame({"A":["A0","A1","A2"],"B":["B0","B1","B2"]},index=["KO","K1","K2"])
right=pd.DataFrame({"C":["C0","C1","C2"],"D":["D0","D1","D2"]},index=["KO","K1","K2"])

In [87]:
left

     A   B
KO  A0  B0
K1  A1  B1
K2  A2  B2

In [88]:
right

     C   D
KO  C0  D0
K1  C1  D1
K2  C2  D2

In [89]:
left.join(right,how="outer")

     A   B   C   D
KO  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

In [94]:
import pandas as pd 
df = pd.DataFrame({"col1":[1,2,3,4],"col2":[444,555,666,444],"col3":["abc","def","ghi","xyz"]})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [95]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

In [96]:
df["col2"].nunique()

3

In [97]:
len(df["col2"].unique())==df["col2"].nunique()

True

In [98]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [101]:
def times2(x):
    return x*2

In [102]:
df["col1"].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [103]:
df["col1"].sum()

10

In [104]:
"string1"+"string2"

'string1string2'

In [105]:
del df["col1"]
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [106]:
df.sort_values(by="col2")

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [108]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [110]:
df=pd.read_csv("example")
df

FileNotFoundError: [Errno 2] No such file or directory: 'example'

In [114]:
df.to_excel("Excel_Sample.xlsx",sheet_name="Sheet1")
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz